/*
*********************************************************************************************************
* File       : hardware.h
*Description : s12g128的硬件设置头文件
*            : 适用芯片mc9s12g128
* Note(s)    : 
*********************************************************************************************************
*/
#ifndef _FILE_H
#define _FILE_H

#include "derivative.h"
#include "hidef.h"
#include "Platform_Types.h"


/***全局变量定义*********************************************/


/***全局函数的定义*******************************************/



/***变量的全局声明*******************************************/
extern uint32 SysTime;

/***函数的全局声明*******************************************/
void CLOCK_Init(void);   //时钟初始化全局声明
void DEV_Init(void);     //芯片初始化全局声明













#endif/**/


















